{"layout":"post","title":"How to use Drupal 8 state in Cron to resume a process.","description":"Explanation about Drupal::State to create a Cron implementation with option to resume the execution","categories":["articles"],"tags":["PHP","Drupal"],"draft":false,"body":"<p>Usually Cron could be used to execute tasks who require a lot of processing, is normal to execute this tasks over a list of items.</p>\n<p>The problem with this requirements is maybe there is not enough with one cron time execution to process the whole elements in our list of items to process. So we have to save the status of our execution to continue the next time the cron is executed.</p>\n<p>We can do that with <a href=\"https://api.drupal.org/api/drupal/core%21modules%21system%21core.api.php/group/queue/8\" target=\"_blank\">Queue Operations</a>, but this solution is complex to implement(maybe just for me) so I will propose a simple option to implement the resume feature.</p>\n<p>#Working with our list of items to process.</p>\n<p>Lets imagine we store our list of items in and array, and the normal option to process and array is using a <a href=\"http://php.net/manual/en/control-structures.foreach.php\" target=\"_blank\">foreach</a>.</p>\n<p>Well we can’t use a foreach in our resume because this function starts his execution with a reset of the internal array pointer to the first element of the array and that is not good for our resume process.</p>\n<p>So I have to use a different solution to do that, let me show you my first implementation</p>\n<pre><code>foreach ( $array as $array_key =&gt; $array_value ) {\n}\n</code></pre><p>Instead of that I decide to use a simple while with some changes to simulate the array key assignation in a variable as you can see in the following snippet.</p>\n<pre><code>while (list($array_key, $array_value) = each($array)) {\n}\n</code></pre><p>#Store last state</p>\n<p>With the problem about array pointer resolved we need store the last correct pointer processed by cron, to store that I use a new feature of Drupal 8 <a href=\"https://api.drupal.org/api/drupal/core!lib!Drupal.php/function/Drupal%3A%3Astate/8\" target=\"_blank\">Drupal::state()</a>.</p>\n<p>Drupal:state store temporary and not critical information, this information is not be migrated between environments in a eventual migration to production.</p>\n<p>Let me show you how to use in combination with while loops</p>\n<pre><code>while (list($array_key, $array_value) = each($array)) {\n\n  // --- INSERT LONG OPERATIONS HERE --\n\n  // Set last bank process to continue after this bank\n  \\Drupal::state()-&gt;set(&#39;last_key&#39;, $array_key);\n}\n\n// Delete last bank if all were processed\n\\Drupal::state()-&gt;delete(&#39;last_key&#39;);\n</code></pre><p>If the hook_cron is interrupted at least we will know in the last index executed without problems, because is stored in state variable <strong>last_key</strong></p>\n<p>If we don’t get any interruption we must delete the state variable.</p>\n<p>#Set array pointer</p>\n<p>First I need to create a custom function named <strong>_array_set_pointer_by_key</strong> to set the array pointer to any arbitrary position, let me show the implementation.</p>\n<pre><code>function _array_set_pointer_by_key(&amp;$array, $key)\n{\n    reset($array);\n    while($index=key($array))\n    {\n        if($index==$key)\n            break;\n\n        next($array);\n    }\n}\n</code></pre><p>The function above works with any kind of array keys.</p>\n<p>Now we need to validate if we have to resume the execution of <strong>hook_cron</strong> in some position of our array of list of items, using again the <strong>Drupal::State</strong> to get the information as you can see in the following piece of code.</p>\n<pre><code>$last_key = \\Drupal::state()-&gt;get($last_bank_variable, null);\n\nif ($last_key) {\n  // Set pointer to last key to process\n  _array_set_pointer_by_key($array, $last_key);\n\n  // Set array to next valid bank to process\n  next($array);\n}\n</code></pre><p>After reset the array we use the <a href=\"http://php.net/manual/en/function.next.php\" target=\"_blank\">next</a> function to move the pointer to next position where we want to resume.</p>\n<p>I hope you find this blog entry useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}