{"layout":"post","title":"Grunt How to list available tasks","description":"Add plugin to Grunt to list available tasks.","categories":["articles"],"tags":["Github","BitBucket","TOC","Node.js"],"draft":false,"body":"<p>In the blog entry <a href=\"{{ site.url }}/articles/2014/06/18/introduction-to-grunt/\">Introduction to Grunt</a> I  explained how we could use Grunt to automate tasks, but the only way to detect the available tasks is review the Gruntfile.js file or perform the tasks, but it’s not be a good idea execute tasks that do not know what they do .</p>\n<p>Fortunately there is a plugin that allows  Grunt toe review tasks available, this plugin is <a href=\"https://github.com/ben-eb/grunt-available-tasks\">grunt-available-tasks</a>. Lets see how we can implement it in our  project.</p>\n<p>#Install plugin.</p>\n<p>The first thing to do is install the plugin available-tasks running assuming you have npm installed just execute the following command.</p>\n<pre><code>$ npm install grunt-available-tasks --save-dev\n</code></pre><p>The above command will add the respective dependency in your package.json file and you will get a similar entry to the following file.</p>\n<pre><code>&quot;grunt-available-tasks&quot;:&quot;0.5.0&quot;\n</code></pre><p>#Add task to Grunt.</p>\n<p>Having as base the file <strong>Gruntfile.js</strong> created in previous entry “Introduction to Grunt” we will include the necessary configuration to add the task to list the available tasks as shown below.</p>\n<pre><code>availabletasks: {\n  tasks: {\n    options: {\n      filter: &#39;exclude&#39;,\n      tasks: [&#39;availabletasks&#39;, &#39;tasks&#39;]\n    }\n  }              \n},\n</code></pre><p>The above action registers the configuration for the plugin <strong>available-tasks</strong> indicating that we want to exclude from the list of tasks “availabletasks” and “tasks “ the last one  is an alias to configure later.</p>\n<p>#Load the plugin.</p>\n<p>In order to execute the comand availabletasks/tasks we have load the plugin with the following settings Gruntfile.js close the end of file as shown in the following listing</p>\n<pre><code>grunt.loadNpmTasks(&#39;grunt-available-tasks&#39;);\n</code></pre><p>#Register the task.</p>\n<p>Finally lets register the task using an alias to facilitate their implementation, for which we just add the following code at the end of the configuration file.</p>\n<pre><code>grunt.registerTask(&#39;tasks&#39;, [&#39;availabletasks&#39;]);\n</code></pre><p>#Run the command</p>\n<p>At this point we could get the tasks available and should just run the following command.</p>\n<pre><code>$ grunt tasks\n</code></pre><p>The above command would get an output  similar to the following image.</p>\n<p><img src=\"{{ site.url }}/assets/img/grunt-tasks.png\"/></p>\n<p>The image above was executed within the project <a href=\"https://github.com/enzolutions/community-bookstore\">Community Bookstore</a>. See the full configuration file at <a href=\"https://github.com/enzolutions/community-bookstore/blob/master/frontend/Gruntfile.js\">https://github.com/enzolutions/community-bookstore/blob/master/frontend/Gruntfile.js</a>.</p>\n<p>I hope you have been to his liking.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}