{"layout":"post","title":"Introduction to Bower","description":"What is Bower and how to use.","categories":["articles"],"tags":["Bower","Node.js","Web","Resources"],"draft":false,"body":"<p><img style=\"float:left; margin-right: 20px;;\" src=\"{{site.url }}/assets/img/bower-logo.png\"/> Continuing with the serie <em>Hot &amp; Sexy tools</em> available these days for web developers started with the entry of Blog <a target=\"_blank\" href=\"{{site.url }}/articles/2014/06/18/introduction-to-grunt/\">Introduction to Grunt</a>, now I come to speak of <a target=\"_blank\" href=\"http://bower.io/\">Bower</a>.</p>\n<p>Bower by definition is a package manager for the web, now that simple English means a tool that allows us to define required libraries in our web applications and the bower detect the dependencies of required packages.</p>\n<p>When bower check all package dependencies requested and find any inconsistency. It presents a menu to choose which version you want to use.</p>\n<p>Now if you ask what kind of packages are available, ranging from packets like <a target=\"_blank\" href=\"https://github.com/jquery/jquery\">jQuery</a> and <a target=\"_blank\" href=\"https://github.com/twbs/bootstrap\">Bootstrap</a> to <a target=\"_blank\"href=\"https://github.com/torvalds/linux\">Linux</a>. All depends on what are our project needs, today bower has nearly fourteen thousand packages.</p>\n<h2 id=\"how-to-install-bower-\">How to install Bower.</h2>\n<p>Bower is a npm package therefore <a target=\"_blank\" href=\"http://npmjs.org/\">Node.js</a> is needed, with the following command we can install Bower.</p>\n<pre><code>$ npm install -g bower\n</code></pre><p>With the above command bower would be available to all system users.</p>\n<h2 id=\"how-to-use-bower-\">How to use Bower.</h2>\n<p>Once Bower is installed you can use immediately in your application to download the packages you want, let’s say you need jQuery in your project, well you only need to use the following command to include it.</p>\n<pre><code>$ bower install jQuery\n</code></pre><p>The above command will have the following output, which informs us that versión of jQuery was downloaded.</p>\n<pre><code>bower cached        git://github.com/jquery/jquery.git#2.1.1\nbower validate      2.1.1 against git://github.com/jquery/jquery.git#*\nbower install       jQuery#2.1.1\n</code></pre><p>If you’re wondering where jQuery is installed in the directory where you run the command, you would have a structure similar to the following representation:</p>\n<pre><code>.\n└── bower_components\n    └── jQuery\n        ├── MIT-LICENSE.txt\n        ├── bower.json\n        ├── dist\n        └── src\n</code></pre><p>You see you get the minimized version of jQuery and files for normal development of jQuery is up to us to decide what files must be include in our application.</p>\n<p>If you want a specific package version you must provide this information in the install process as shown in the following command:</p>\n<pre><code>$ bower install &lt;package&gt;#&lt;version&gt;\n</code></pre><h2 id=\"group-project-dependencies-\">Group project dependencies.</h2>\n<p>As we saw is quite easy to add new components, but it depends on someone memory  to install the required packages, to define all the required packages for our project we use the bower.json file.</p>\n<p>Fortunately bower provides us a command that lets you create a basic bower.json file, you can see an output of interactive command <em>$ bower init</em>.</p>\n<pre><code>$ bower init\n[?] name: MegaProject\n[?] version: 0.1.0-alpha\n[?] description: Not Available\n[?] main file: assets/js/main.js, assets/css/main.css\n[?] what types of modules does this package expose?\n[?] keywords: HTML5\n[?] authors: enzo - Eduardo Garcia &lt;enzo@anexusit.com&gt;\n[?] license: MIT\n[?] homepage: http://enzolutions.com\n[?] set currently installed components as dependencies? Yes\n[?] add commonly ignored files to ignore list? Yes\n[?] would you like to mark this package as private which prevents it from being [?] would you like to mark this package as private which prevents it from being accidentally published to the registry? No\n</code></pre><p>This command above will generate a file called bower.json with the following content.</p>\n<pre><code>{\n  &quot;name&quot;: &quot;MegaProject&quot;,\n  &quot;version&quot;: &quot;0.1.0-alpha&quot;,\n  &quot;authors&quot;: [\n    &quot;enzo - Eduardo Garcia &lt;enzo@anexusit.com&gt;&quot;\n  ],\n  &quot;description&quot;: &quot;Not Available&quot;,\n  &quot;main&quot;: &quot;assets/js/main.js, assets/css/main.css&quot;,\n  &quot;keywords&quot;: [\n    &quot;HTML5&quot;\n  ],\n  &quot;license&quot;: &quot;MIT&quot;,\n  &quot;homepage&quot;: &quot;http://enzolutions.com&quot;,\n  &quot;ignore&quot;: [\n    &quot;**/.*&quot;,\n    &quot;node_modules&quot;,\n    &quot;bower_components&quot;,\n    &quot;test&quot;,\n    &quot;tests&quot;\n  ],\n  &quot;dependencies&quot;: {\n    &quot;jQuery&quot;: &quot;~2.1.1&quot;\n  }\n}\n</code></pre><p>Now what advantage we get from file bower.js file? The first one is portability because we just need put this file in our version control system and when a new developer arrive to team for sure we will need set up his environment; then he just need download the bower.json and run the following command:</p>\n<pre><code>$ bower install\n</code></pre><p>In this case bower detects the existence of a bower.json file and will proceed to install packages included in the file, allowing us to maintain our system clean and avoid having stored 50 versions of jQuery when in the end we are interested in last version of jQuery.</p>\n<h2 id=\"specify-destination-packages-\">Specify destination packages.</h2>\n<p>As we saw before the default destination is <em>bower_components</em> folder, but it is very likely that this location is not to our liking, if we want to specify a custom destination folder we need to create a file .bowerrc to inform bower about our needs, as shown below.</p>\n<pre><code>{\n    &quot;directory&quot;: &quot;web/vendor&quot;\n}\n</code></pre><p>Which will make the packets are stored in the folder <em>web/vendor</em> or any other you want.</p>\n<p>I hope you have been to his liking.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}