{
  "layout":"post",
  "title":"What is and how it works RequireJS",
  "description":"Explanation about how to implement RequireJS.",
  "categories":["articles"],
  "tags":["Ajax","Javascript","RequireJS","MarionetteJS"],
  "draft":false,
  "body":"<p><a target=\"_blank\" href=\"http://requirejs.org/\">RequireJS</a> is a JavaScript library that allows us to isolate the components of our JS application as modules and resolve their dependencies.</p>\n<p>RequireJS implements the design pattern of software <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Asynchronous_module_definition\">AMD</a> (Asynchronous Module Definition) which you could say is very similar to <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Dependency_injection\">Dependency injection</a> implemented by frameworks like <a target=\"_blank\" href=\"http://symfony.com/\">Symfony</a>.</p>\n<p>Let’s check how we can use in our JS application in simple steps.</p>\n<h2 id=\"1-define-entry-point-for-requirejs-\">1. Define entry point for RequireJS.</h2>\n<p>We must download the lastest version of RequireJS library available on the website <a target=\"_blank\" href=\"http://requirejs.org\">http://requirejs.org</a>, after download will put in a directory called libs just for purposes of this example (tested with version 2.1.11).</p>\n<p>Now we need to  define a html file and could named index.html where RequireJS is loading as shown below.</p>\n<pre><code>&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n&lt;head&gt;\n&lt;/head&gt;\n&lt;body&gt;\n  &lt;script data-main=&quot;libs/main&quot; src=&quot;libs/require.js&quot;&gt;&lt;/script&gt;\n&lt;/body&gt;\n&lt;/html&gt;\n</code></pre><p>As you can see the inclusión is done with the script tag at the end of the HTML tag body, but it could also be done within the head tag.</p>\n<p>It’s also possible to include RequireJS remotely using the URL <a target=\"_blank\" href=\"http://requirejs.org/docs/release/2.1.11/minified/require.js\">http://requirejs.org/docs/release/2.1.11/minified/require.js</a> or similar, but it is a desition of the reader.</p>\n<p>As can be seen RequireJS  use the meta-data property <em>data-main</em>(, with this property we can define the entry point for RequireJS configuration, which is a relative path for the file we choose to load teh RequireJS configuraton (is necesarry exlude the js extension).</p>\n<h2 id=\"2-configure-requirejs\">2. Configure RequireJS</h2>\n<p>In the file libs/main.js we define the RequireJS options. The first thing we should to define is which JS libraries will use in our application as shown below.</p>\n<pre><code>require.config({\n    baseUrl: &#39;libs&#39;,\n    paths : {\n      backbone : &#39;backbone&#39;,\n      underscore : &#39;underscore&#39;,\n      jquery : &#39;jquery&#39;,\n      marionette : &#39;backbone.marionette&#39;,\n      wreqr : &#39;backbone.wreqr&#39;,\n      eventbinder : &#39;backbone.eventbinder&#39;,\n      babysitter : &#39;backbone.babysitter&#39;\n  }\n});\n</code></pre><p>All files are seek in the directory defined using the <em>baseUrl</em> property, and the <em>paths</em> property allow define the location of the libraries required with a key to refer to the library later. The js extension is not required and will be added by RequireJS later.</p>\n<p>As its name suggests the pattern AMD makes an asynchronous load of packages. But because not all the libraries implement the AMD pattern, is likely to a library A try to use a function defined in library B not yet loaded causing a fatal error.</p>\n<p>To resolve this issue we use the property <em>Shim</em> part of  RequireJS configuration, as we see below.</p>\n<pre><code>require.config({,\n  shim : {\n    jquery : {\n      exports : &#39;jQuery&#39;\n    },\n    underscore : {\n      exports : &#39;_&#39;\n    },\n    backbone : {\n      deps : [&#39;jquery&#39;, &#39;underscore&#39;],\n      exports : &#39;Backbone&#39;\n    },\n    wreqr: {\n      deps : [&#39;backbone&#39;]\n    },\n    eventbinder : {\n      deps : [&#39;backbone&#39;]\n    },\n    babysitter : {\n      deps: [&#39;backbone&#39;]\n    },\n    marionette : {\n      deps: [&#39;wreqr&#39;, &#39;eventbinder&#39;, &#39;babysitter&#39;],\n      exports : &#39;Marionette&#39;\n    }\n  }\n});\n</code></pre><p>Using Shim we can define dependencies between libraries and allow to export global variables that can be used within other libraries such as jQuery library which  export  the variable jQuery.</p>\n<p>The configuration with the Shim is a replacement for Order plugin used before version 2.0 of RequireJS.</p>\n<p>The exports variable can also be an anonymous function to return the call noConflict function, if the library supports it.</p>\n<p>Using the <em>deps</em> property, you can define multiple dependencies of libraries should be loaded before including the library that are defining, such as backbone that depends on jquery and underscore to be used.</p>\n<p>Of course if we want to use the library with RequireJS  and supports AMD configuration pattern Shim isn’t required.</p>\n<h2 id=\"3-how-to-execute-code-required-\">3. How to execute code required.</h2>\n<p>Once defined libraries and its dependencies if necessary, we can now rewrite the code we need as shown below.</p>\n<pre><code>// Loading dependences and execute Marionette App\nrequire( [&quot;marionette&quot;], function (Marionette) {\n    // set up the app instance\n    var MyApp = new Marionette.Application();\n\n    MyApp.on(&quot;initialize:after&quot;, function(){\n      alert(&quot;Application has started!&quot;);\n    });\n\n    MyApp.start();\n});\n</code></pre><p>The above code checks that all the libraries needed to run Marionette are loaded before executing the code and get the exported global variable as a parameter.</p>\n<p>In the anonymous function will create a Marionette Application and start it, As result we  will get an alert with the message “Application has started”.</p>\n<p>The require function has the same effect of an anonymous function, meaning that run without problems but can not be used later.</p>\n<h2 id=\"4-how-to-create-named-modules-\">4. How to create named modules.</h2>\n<p>If we want encapsulate our App we must create named modules using the funcion <em>define</em>; The diference with require function is  an extra parameter that is used to name the module and returns an object or variable that will be used when the module is instantiated.</p>\n<p>Then consider the previous example as a named module.</p>\n<pre><code>define( &#39;MyApp&#39;, [&quot;marionette&quot;], function (Marionette) {\n\n    // set up the app instance\n    var MyApp = new Marionette.Application();\n\n    MyApp.on(&quot;initialize:after&quot;, function(){\n      alert(&quot;Application has started!&quot;);\n    });\n\n    // export the app from this module\n    return MyApp;\n});\n\n// Fetch and execute Marionette App\nrequire( [&quot;MyApp&quot;], function (MyApp) {\n    // Execute App\n    MyApp.start();\n});\n</code></pre><p>As you see we register a named module <em>MyApp</em> and  returns an object defined in Marionette.</p>\n<p>Then with a <em>require</em> function the module is loaded, it receives as parameters the object returns by the module and can thus start our application.</p>\n<p>It might seem a waste of time doing it this way as it is in the same file, but the idea is to create a module for file and using the configuration of RequireJS load all the libraries that define modules and then use these modules in our application.</p>\n<p>You can download the <a target=\"_blank\" href=\"{{ site.url }}/projects/marionettejs_skeleton_app\">Marionette App Skeleton</a> repository which implements the concepts discussed here.</p>\n<p>I hope you have been to his liking.</p>\n",
  "updatedAt":"2017-09-05T17:40:56.000Z"
}
