{"layout":"post","title":"Understanding migrations in Drupal 8","categories":["articles"],"tags":["Drupal","Drupal8","Migrate","Drupal","Console"],"body":"<p>As you know Drupal 8 was released at Nov 19 / 2015 (finally).</p>\n<p>One of the most recurrent questions is <strong>“It’s time to create new projects in Drupal 8”</strong>, but there is another difficult question. <strong>“How I can migrate my current Drupal 7/6/* to Drupal 8”</strong> </p>\n<p>To try to answer that question let me explain a little bit how Migration works in Drupal 8.</p>\n<h1 id=\"modules-required\">Modules required</h1>\n<p>Drupal 8 provide in their core modules the <strong>Migrate</strong> module, this module provide a mini framework to be user to migrate from <em>Any source</em> to Drupal 8. I said ANY because this module itself doesn’t have any logic related to Drupal stuff.</p>\n<p>The idea is if you plan to migrate from a specific source like Drupal, Wordpress, CQ5 etc you must write an integration to handle the transformation of content into Drupal 8 structure.</p>\n<p>Fortunately for us at least we have a Drupal 8 core module related to Drupal named <strong>Migrate Drupal</strong>, this module contains some Migrate plugin to run the migration process between older Drupal versions to Drupal 8, but this module doesn’t contain migration definitions since Drupal 8 beta 13</p>\n<p>Therefore, the first step you need to do is install these modules, I will use the project <a href=\"http://drupalconsole.com\">Drupal Console</a> for this tasks and I will continue using some commands available related with migration.</p>\n<pre><code>$ drupal module:install migrate migrate_drupal\n</code></pre><h1 id=\"where-i-can-find-migrations\">Where I can find migrations</h1>\n<p>After install modules Migration and Migrate Drupal, I guess you are waiting for something in UI to start to handle your migrations. Sadly there is nothing inside Drupal Core to provide a UI for migration, this responsibility relies on two contributed modules <a href=\"https://www.drupal.org/project/migrate_plus\">Migrate Plus</a> and <a href=\"https://www.drupal.org/project/migrate_upgrade\">Migrate Upgrade</a>.</p>\n<p>Each module apply a different point of view about migrations, both IMHO looks like <em>Migrate Upgrade</em> it’s in a more mature state. But, there is always a but, I don’t like the idea that you are only available to see all migrations available when you are running the migration itself.</p>\n<p>With Drupal just released it’s probably that you will be in a stage where you don’t really know what are you doing, so I decided to implement some migration command inside <strong>Drupal Console</strong> project with my own point of view.</p>\n<h1 id=\"loading-migrations\">Loading migrations</h1>\n<p>As I said before I prefer load migrations but without running a migration yet. For that purpose, I did a command <strong>migrate:setup</strong> as you can see in following CLI execution sample.</p>\n<pre><code>$ drupal migrate:setup --db-type=mysql --db-host=127.0.0.1 --db-name=plato_tipico --db-user=root --db-pass=root --db-port=3306 --no-interaction\n</code></pre><p>In the sample above I pass all parameters using inline mode, but if you omit an option, the command will start the interactive mode. Remember to remove the option <em>–no-interaction*</em> to enable the interactive mode.</p>\n<p>The command above will inspect your legacy DB and import all migrations available in Drupal 8 to be used with your legacy DB.</p>\n<p>All migration entities created will remain in your system, even after complete a migration process.</p>\n<h1 id=\"get-list-of-migrations\">Get list of migrations</h1>\n<p>In order to get a list of migrations available in your system, you must execute the following command</p>\n<pre><code>$ drupal migrate:debug\n</code></pre><p> As you can appreciate in the following image some migrations work in more that one Drupal legacy version</p>\n<p><img src=\"{{ site.url }}/assets/img/console_migrate_debug.png\"/> </p>\n<h1 id=\"execute-a-migration\">Execute a migration</h1>\n<p>After reviewing your system in term of migrations available, we could execute all migrations available for your legacy system you can execute the following command to start a full migration process.</p>\n<pre><code>$ drupal migrate:execute all --db-type=mysql --db-host=127.0.0.1 --db-name=plato_tipico --db-user=root --db-pass=root --db-port=3306 --no-interaction\n</code></pre><p>Below you can see how looks the migration process.</p>\n<p><img src=\"{{ site.url }}/assets/img/console_migrate_execute.png\"/>  </p>\n<p>The image above shows how the command report what migrations fail and what migration works. As you can see each migration is independent and the migration process is not interrupted if some of them fail.</p>\n<p>But if you want to avoid to execute one of more migration to avoid any exception you can use the parameter <strong>–exclude</strong> providing the migration id(s) do you want to exclude, you can get those ids from <em>migrate:debug</em> command.</p>\n<p>Moreover, if you only want to execute one or a couple of migrations, just change the parameter <strong>all</strong> for any migration id(s) do you want, this is useful to execute a partial migration after resolve any issues found after executing a full migration process</p>\n<h1 id=\"where-are-located-migrations-\">Where are located migrations.</h1>\n<p>Now you are wondering <strong>“Where are located migration”</strong> if they aren’t in Migrate or Migrate Drupal. Well, migrations are allocated in each specific module, for instance if you review in your Drupal Core modules in path <strong>/core/modules/book/migration_templates</strong> you will find some YAML files with the information necessary to create a Migration entity in your system. When you executed the command <strong>migrate:setup</strong> all migration_templates folder were parsed to create Migration Entities.</p>\n<p>#Caveats\nRight now there are mostly migrations available for Drupal 6, I guess the bet is related Drupal 6 are more critical to be migrated to Drupal 8.</p>\n<p>You can find more Drupal 7 migration proposed as issues in <a href=\"http://groups.drupal.org/imp\">http://groups.drupal.org/imp</a> sandbox, in <a href=\"http://anexusit.com\">Anexus</a> we propose around 70 migration entities for Drupal 7 and 10 of them were already accepted in Drupal 8 core. I promise to provide a list of all our Drupal 7 Migration in few weeks.</p>\n<p>I hope you found this article useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}