{"layout":"post","title":"How to merge YAML files","categories":["articles"],"tags":["YAML","Silex","Symfony","Console"],"body":"<p>By definition, a <a href=\"http://yaml.org/\">YAML</a> is a human-friendly data serialization standard for all programming languages.\nBut, in a less formal definition YAML is a great format for your configuration files, because, YAML files are as expressive\nas XML files and as readable as INI files.</p>\n<p>Currently, I am using YAML files for configuration in my <a href=\"http://drupal.org\">Drupal</a>, <a href=\"http://silex.sensiolabs.org/\">Silex</a>\nand <a href=\"http://symfony.com/\">Symfony</a> projects. Until now I could say is a good way to save information but I don’t have a strong \npreference versus other formats, however, is easy to use, so no regrets.</p>\n<p>However, a YAML file could represent anything, let me show you some examples.</p>\n<p>The first one from <a href=\"http://drupalconsole.com\">Drupal Console</a> \nproject where YAML files are used to store the translations string as you can see for <a href=\"https://github.com/hechoendrupal/DrupalConsole/blob/master/config/translations/en/application.yml\">English</a> and <a href=\"https://github.com/hechoendrupal/DrupalConsole/blob/master/config/translations/es/application.yml\">Spanish</a>. Check\n an extract of translation.</p>\n<pre><code>console:\n    arguments:\n        drupal: &#39;Ruta a la raíz de Drupal&#39;\n        shell: &#39;Iniciar el shell.&#39;\n        env: &#39;Nombre del ambiente.&#39;\n        no-debug: &#39;Desactivar el modo de depuración.&#39;\n        learning: &#39;Generar código con explicaciones.&#39;\n        generate-chain: &#39;Imprimir opciones y argumentos como YAML para ser usado el comando chain&#39;\n        generate-inline: &#39;Imprimir opciones y argumentos de ejecución como llamada inline para ser usados en el futuro&#39;\n        root: &#39;Define la raíz de Drupal que se utilizará en la ejecución de los comandos&#39;\n        uri: &#39;URI del sitio en Drupal que se usará (para ambientes en multi-site o cuando esta usando un puerto alternativo)&#39;\n    messages:\n        completed: &#39;¡Ya puede empezar a usar el código generado!&#39;\n        chain:\n            generated: &#39;A continuación puedes observar la representación en YAML del último comando ejecutado, puede copiarlo en ~/.console/chain/sample.yml para ejecutarlo en una secuencia de comandos&#39;\n        inline:\n            generated: &#39;A continuación puedes encontrar la representación inline de este comando para volver a ejecutarlo más tarde&#39;\n        generated: &#39;¡Ya puedes empezar a usar el código generado!&#39;\n        files:\n            generated: &#39;¡Ya puedes comenzar a usar el código generado!&#39;\n</code></pre><p>The second one from <a href=\"http://drupal.org\">Drupal</a> where is used by <a href=\"https://www.drupal.org/drupal-8.0/features#configuration\">Configuration Management</a> to export and import configuration across environments. \nLet me show you an example of a basic content type.</p>\n<pre><code>uuid: f5c966ac-b9a8-4ab8-b335-5380c6bb8524\nname: drupal8.dev\nmail: admin@example.com\nslogan: &#39;&#39;\npage:\n  403: &#39;&#39;\n  404: &#39;&#39;\n  front: /node\nadmin_compact_mode: false\nweight_select_max: 100\nlangcode: en\ndefault_langcode: en\n</code></pre><p>Now with all these YAML files surrounded our applications, a new kind of common and challenging tasks appears.</p>\n<p>In the case of\nDrupal Console project, because the project is in active development; new features and fixes are included constantly in\nthe code base and their translation are allocated in several YAML files, those files are always quite ahead than their translations, and\ntry to update without loose current translations is a slow and manual process.</p>\n<p>As programmers, we hate manual tasks and in this particular case we always said “If only there be a command or util to do this silly task”,\nwell I did to myself that question and my answer was, include in <strong>Drupal Console</strong> release <a href=\"https://github.com/hechoendrupal/DrupalConsole/releases/tag/0.7.15\">0.7.15</a> a new command\n <strong>yaml:merge</strong></p>\n<p>To execute this command, you need at least two YAML files to merge, as you can see in the following batch sentence.</p>\n<pre><code>$ drupal yaml:merge new.yml console.en.yml console.es.yml\n</code></pre><p>What will happen after executing this command is a new file named new.yml containing all <strong>console.en.yml</strong> entries and entries translated in <strong>console.es.yml</strong>, in this way new translations will be maintained and new entries will be included in the new file.</p>\n<p>Is possible to set the same file as last parameters and destination to have an immediate overwrite, but a new file is recommended to check the results.</p>\n<p>If it’s required you can include as many YAML files are required to merge, but, take into account that the YAML files in the right side of command will always overwrite their entries.</p>\n<p>The Drupal Console has this kind of problems because there are different sources of contributions and different amount of contributions for language, but \nin the future I can image in Drupal we could have similar kind of requirements when the same piece of configuration is updated in different environment and \nwe have the need of merge in one solution.</p>\n<p>If you are not a user of <strong>Drupal Console</strong> but you need this command, don’t worry if you don’t have a Drupal environment, \nDrupal Console is a <a href=\"http://php.net/manual/en/intro.phar.php\">Phar</a> application completely independent of Drupal. To use a command like <strong>yaml:merge</strong>, just install it,\ndo your job and remove it, if it’s not required anymore.</p>\n<p>Other commands in Drupal Console related with YAML files are:</p>\n<pre><code>yaml:update:value\nyaml:update:key\nyaml:split\nyaml:diff\n</code></pre><p>I hope you found this article useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}