{"layout":"post","title":"Soy candidato por una posición en la Drupal Association como Large director","categories":["articles"],"tags":["Drupal Association","Community","Drupal"],"body":"<p>Hoy he decidido nominar a mí mismo como un candidato para un puesto en la <a href=\"https://assoc.drupal.org/\" target=\"_blank\">Drupal Association</a> como <strong>Large Director</strong>.</p>\n<p>Puedes leer más sobre el proceso electoral en <a href=\"https://assoc.drupal.org/blog/holly.ross.drupal/nominations-open-drupal-association-large-director\" target=\"_blank\">Nominations Open for Drupal Association At Large Director</a>.</p>\n<p>#Fechas importantes</p>\n<ul>\n<li>Auto nominaciones: 1 Feb,2015 a 20 Feb, 2015</li>\n<li>Elecciones: 9 Mar, 2015 a 20 Mar, 2015</li>\n</ul>\n<p>Así que permítanme decirles algo acerca de mi y mis motivaciones para proponer mi nombre.</p>\n<p>#Acerca de mi\nColombian de nacimiento, Costarricense por elección, he pasado los últimos 13 años viviendo en esa estrecha franja de tierra entre Norte y Sur América. Co-fundador de AnexusIT.</p>\n<p>Tengo 38 años, casado y padre de dos niños: Axel y Zoe. Disfruto de largos paseos por los pasillos de los Drupal Groups y cierta habilidad para la organizar eventos de la comunidad.</p>\n<p>Conocí Drupal 6 a principios de 2008 después de trabajar durante muchos años construyendo sitios web desde cero usando PHP y después de muchos meses de contribuir a un par de proyectos de PHP con la intención de automatizar la forma en sitios web son construidos.</p>\n<p>#Experiencia\nMi primer proyecto Drupal fue un verdadero reto, simplemente porque los plazos eran muy apretados (sorpresa, sorpresa) y no tenía ni idea de cómo empezar a trabajar en en Drupal. Aun así oo era el encargado de liderar el camino y enseñar a otros. Rl proceso fue muy frustrante, pero sin embargo el proyecto fue entregado con un retraso de solo unos días, acabé odiando el proyecto, y amando a la plataforma de CMS.</p>\n<p>Mi primer contacto con la comunidad fue en 2009 en la primera Drupal Camp Centroamericano en Nicaragua donde hice dos conferencias y donde aprendí mucho sobre la comunidad y qué tan fuerte es el producto podría ser.</p>\n<p>Después de dos años trabajando para empresas haciendo Drupal, tomé la decisión de iniciar la primera totalmente orientada a Drupal Costa Rica alrededor de 2010. AnexusIT fue la primera empresa de su tipo en Centroamérica.</p>\n<p>En AnexusIT Dirijo las áreas tecnológicas y técnicas de la empresa. Llego a usar muchos sombreros, aunque el director de tecnología es mi título oficial. Mi papel favorito es el de desarrollador Drupal, donde trato de motivar, liderar, supervisar y animar a mis compañeros de trabajo al mismo tiempo que programar al menos 8 horas cada día.</p>\n<p>Después de la Drupal Camp Centroamericano en Nicaragua empecé a organizar Drupal Meetups en Costa Rica y en la edificación de la comunidad Drupal en Costa Rica. Como resultado de ello, organizamos el primera Drupal Camp Costa Rica (y tercera Drupal Camp Centroamericano) a finales de 2011. Hemos sido anfitriones de este evento en Costa Rica cada año donde la última edición se celebro en agosto 2014.</p>\n<p>Durante todo este tiempo yo diriji a la comunidad en Costa Rica sin un título oficial, porque nos faltaba una estructura formal. Para remediar esto, en enero de 2015, nosotros (la comunidad) fundamos una ONG llamada “Drupal Costa Rica”, donde yo soy el co-fundador y primer presidente. Planeamos usar la ONG para facilitar las tareas de la coordinación de las actividades de Drupal en Costa Rica.</p>\n<p>#Motivación.</p>\n<p>En los últimos años la Drupal Association ha empezado a orientarse mas al mundo con la inclusión de los miembros de Europa y Australia, pero aunque la visión ahora es más global es aún la visión de personas de países con un alto nivel de desarrollo.</p>\n<p>Después de algunas conversaciones con un amigo de Vietnam <a href=\"http://de.linkedin.com/in/webtomme/\" target=\"_blank\">Tom Soqyu</a> acerca de las experiencias en actividades destinadas a la construcción de una comunidad de Drupal y tareas orientadas a crear el primer Drupal en Vietnam detectamos que a pesar de la distancia nos enfrentamos a problemas similares debido a que vivimos en países no desarrollados o de mercados emergentes si desea utilizar otro término.</p>\n<p>Entonces, ¿qué ideas que apoyaré en asociación Drupal, Bueno me encantan iniciativas para patrocinar conferencistas que permitan la formación de personas en los países emergentes, especialmente si hablan el idioma del país emergente como por ejemplo francés y Inglés en muchos países de África. Si obtengo una posición en la Drupal Association voy a apoyar proyectos en esa indole.</p>\n<p>Así que basado en mi experiencia de 5 años trabajando con Drupal developer, Líder de una Comunidad y propietario de empresa en un país emergente, quiero llevar a la Drupal Association una perspectiva diferente acerca de nuestros retos e ideas sobre cómo mejorar la presencia de Drupal en América Latina, África y Asia.</p>\n<p>#Contácteme\nNo dude en hacerme cualquier pregunta a través de Facebook, Twitter, correo electrónico o utilizando los comentarios en está entrada de blog.</p>\n<p>Como se puede imaginar le estoy pidiendo que voten por mí. Pero también los invito a comprobar todos los candidatos y determinar cual coincide mejor con su forma de pensar y sentir. También no se olvide de invitar a sus amigos a votar.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}