{"layout":"post","title":"How to include PHP code in Drupal 8 Views","categories":["articles"],"tags":["Drupal8","Views","PHP"],"body":"<p>Did you recall the last time you tried to resolve an issue in your program using a small piece of PHP in your views using <a href=\"https://www.drupal.org/project/views_customfield\">Views Custom Field</a> in Drupal 6 and  <a href=\"https://www.drupal.org/project/views_php\">Views PHP</a> in Drupal 7? Don’t lie everybody did that at least once.</p>\n<p>Even the fact those are accepted module by the Drupal security team, this solution is really dangerous because execute code using PHP function <a href=\"http://php.net/manual/es/function.eval.php\">eval</a>, execute PHP code loaded from DB it’s really bad in terms of security and stability.</p>\n<p>Moreover, if someone is auditing your code, this one is the first bad practice the auditor will try to find in your code and you will get a nice recommendation that you must create your own view field handler to do that logic, in order to improve the quality of your code. But to be honest, I did that in the past and even I did that several times, I always found this process really hard.</p>\n<p>Nowadays the Drupal community is excited about the release of the first official release of <a href=\"https://www.drupal.org/news/drupal-8.0.0-released\">Drupal 8</a>, so I thought it’s time to start with the classical posts about how to do our old practices in this new thing. Today I will share with you how to avoid the usage of Views PHP modules and be able to include PHP in your views but still pass the audit of your code :P.</p>\n<p>In this post, I will use the project <a href=\"http://drupalconsole.com\">Drupal Console</a> to facilitate my job.</p>\n<p>#1. Create a Drupal 8 module.\nTo generate a module you have two options, the first one is using the interactive mode, where the application will ask you all options available in the command. Use the following command to execute the interactive mode, check the following image to see a classical execution.</p>\n<pre><code>$ drupal generate:module\n</code></pre><p><img src=\"{{ site.url }}/assets/img/console_generate_module.png\"/></p>\n<p>The second option executes the command but passing all options inline as you can see below.</p>\n<pre><code>$ drupal generate:module --module=&quot;No Views PHP&quot; --machine-name=no_views_php --module-path=/modules/custom --description=&quot;Custom views field to include PHP logic in views.&quot; --core=8.x --package=Other\n</code></pre><p>#2. Generate a custom views field\nViews are now in core of Drupal 8, and everything change. As I said before “Drupal 8 is just a new project with same name and logic”. So if you knew something about views, well that is not too much useful in terms of code, but the logic, in general remains.</p>\n<p>In Drupal 8 views, everything is handled via Plugins and fields are not the exception, if you need to create a custom field you must generate a custom views plugin field. Fortunately, I did a generator in <strong>Drupal Console</strong> for this task, check the following command to generate a views plugin field.</p>\n<pre><code>$ drupal generate:plugin:views:field --module=no_views_php --class=PHPViewsField --title=&quot;PHP Field&quot; --description=&quot;Enable to include and run PHP code in your modules as part of a view&quot;\n</code></pre><p>The command above will generate the following files:</p>\n<pre><code>Site path: /Users/enzo/www/drupal8-rc1\n1 - modules/custom/no_views_php/no_views_php.views.inc\n2 - modules/custom/no_views_php/src/Plugin//views/field/PHPViewsField.php\n</code></pre><p>#3. Install your module.\nNow we need to install our generated module with the following command.</p>\n<pre><code>$ drupal module:install no_views_php\n</code></pre><p>Now if you edit the Frontpage view at <strong><a href=\"http://example.com/admin/structure/views/view/frontpage\">http://example.com/admin/structure/views/view/frontpage</a></strong> you can use the custom field generated after change the mode from show <em>content</em> to show <em>fields</em> as you can see in the following image.</p>\n<p><img src=\"{{ site.url }}/assets/img/views_custom_plugin.png\"/></p>\n<p>Pro tip: If you don’t see your generated field, try executing <strong>$ drupal cache:rebuild all</strong> again :P</p>\n<p>After applying the minimum configuration to the field, you will get a view preview similar to this image:</p>\n<p><img src=\"{{ site.url }}/assets/img/view_frontpage_preview.png\"/></p>\n<p>The view plugin field generated, by default, return a random string just to show that it’s working. Now you have to do your magic in your custom module.</p>\n<p>#4. Implementing your logic\nIn order to implement your custom logic you have to edit the generated file <strong>modules/custom/no_views_php/src/Plugin//views/field/PHPViewsField.php</strong> and more specific inside the method <strong>render</strong>, this method receives an object of <a href=\"https://api.drupal.org/api/drupal/core!modules!views!src!ResultRow.php/class/ResultRow/8\">Drupal\\views\\ResultRow</a> as a parameter.</p>\n<p>The default method generated looks like next snippet.</p>\n<pre><code>public function render(ResultRow $values) {\n  // Return a random text, here you can include your custom logic.\n    // Include any namespace required to call the method required to generte the\n    // output desired\n    $random = new Random();\n    return $random-&gt;name();\n}\n</code></pre><p>Now I will change the logic to use the title field in row to print it reversed, as you can check in the following code.</p>\n<pre><code>public function render(ResultRow $values) {\n    // Return a random text, here you can include your custom logic.\n    // Include any namespace required to call the method required to generte the\n    // output desired\n    $title = strip_tags($this-&gt;view-&gt;field[&#39;title&#39;]-&gt;original_value);\n    return strrev($title);\n}\n</code></pre><p>As a result now our field will look different, check the following image.</p>\n<p><img src=\"{{ site.url }}/assets/img/view_frontpage_preview2.png\"/></p>\n<p>As you can see this another silly implementation of a custom PHP, but now you can include in this class any service required to do your magic and transform each row in a view using other row fields as input.</p>\n<p>Even better you can include in your code a handler to throw an exception if is required, so your code could as complex and professional as you want.</p>\n<p>If you are wondering why don’t contribute this as a replacement of Views PHP in Drupal 8, well I thought due we have a Drupal Console generator for that, it’s not necessary. Inside Drupal Console project is the eternal discussion about what things must be a generator and what others must be contributed modules.</p>\n<p>Some of them became in both a generator and Drupal 8 modules, check out the following list</p>\n<ul>\n<li><a href=\"https://www.drupal.org/project/entity_rest_extra\">Entity Rest Extra</a></li>\n<li><a href=\"https://www.drupal.org/project/ip_consumer_auth\">IP Consumer Auth</a></li>\n<li><a href=\"https://www.drupal.org/project/image_raw_formatter\">Image Raw Formatter</a></li>\n</ul>\n<p>I hope you found this blog post useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}