{"layout":"post","title":"How to get content type fields in Drupal 8","categories":["articles"],"tags":["Drupal","Drupal 8","PHP"],"body":"<p>The creation of custom logic for our customer sometimes requires a certain level of automatisation in terms that our logic must be flexible to support changes in the data structure.</p>\n<p>In Drupal 8 the most common way to represent data is using node entities, and we could create different types of content types or bundles for node entities.</p>\n<p>Each content type could increase or decrease the amount and type of fields assigned to each content type, and our code must be prepared to handle that situations.</p>\n<p>I will explain to you, how to get content type definition and use that information to flatten a node object into an array.</p>\n<p>#Getting content type fields definition</p>\n<p>Firstly I will create a function to get fields definition for a content type machine name provided, of course, you can implement this function as a method in your classes. </p>\n<pre><code>function contentTypeFields($contentType) {\n    $entityManager = Drupal::service(&#39;entity.manager&#39;);\n    $fields = [];\n\n    if(!empty($contentType) {\n        $fields = array_filter(\n            $entityManager-&gt;getFieldDefinitions(&#39;node&#39;, $contentType), function ($field_definition) {\n                return $field_definition instanceof FieldConfigInterface;\n            }\n        );\n    }\n\n    return $fields;      \n}\n</code></pre><p>In this case, I am only interested in use field machine name, but you can do a different approach to doing something with field definition itself.</p>\n<p>Also, I use node as a hard-coded entity type, but you can use any entity, to get their bundle field definition.</p>\n<p>#Flatten node</p>\n<p>Using the field definition array, we can get all node values and assign to an array. I will use an imaginary content type machine name <em>ticket</em></p>\n<pre><code>use Drupal\\node\\Entity\\Node;\nuse Drupal\\field\\FieldConfigInterface;\n\n// Load node\n$node = Node::load($ticketID);\n\n$fields = contentTypeFields(&#39;ticket&#39;); // Replace your content type machine name here.\n\n$ticket[&#39;title&#39;] = $node-&gt;get(&#39;title&#39;)-&gt;value;\nforeach($fields as $fieldID =&gt; $field){\n    $ticket[$fieldID] = $node-&gt;get($fieldID)-&gt;getValue();\n}\n\nprint_r($ticket);\n</code></pre><p>The code above will produce an output similar to this</p>\n<pre><code>Array\n(\n    [title] =&gt; This is an unassigned ticket\n    [field_description] =&gt; Array\n        (\n            [0] =&gt; Array\n                (\n                    [value] =&gt; Create a ticket with no one assigned to make sure the system handles it well\n                )\n\n        )\n    [field_status] =&gt; Array\n        (\n            [0] =&gt; Array\n                (\n                    [target_id] =&gt; 2\n                )\n\n        )\n\n    [field_ticket_type] =&gt; Array\n        (\n            [0] =&gt; Array\n                (\n                    [target_id] =&gt; 9\n                )\n\n        )\n\n)\n</code></pre><p>After transform node into an innocuous array, you can add or remove any information required.</p>\n<p>This kind of transformation is useful in Drupal 8, to skip some validation in the object render to avoid content injection.</p>\n<p>Maybe you are thinking why not use function <a href=\"http://php.net/manual/en/function.get-object-vars.php\">get_object_vars</a>, well all properties are protected and are only accessible using get method, get_object_vars only return public properties, so doesn’t work for our purpose.</p>\n<p>Another idea could be, just use an array casting to transform node object into an array, but if you try to do that and exception is thrown with the following error message.</p>\n<p><strong>A fatal error occurred: Could not normalize object of type Drupal\\Core\\Field\\BaseFieldDefinition, no supporting normalizer found.</strong></p>\n<p>I hope did you found this article useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}