{"layout":"post","title":"Hanoi Day 3 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Hanoi","Vietnam"],"body":"<p>After return to Hanoi, we took some time to prepare our (me and <a href=\"http://yersika.com\">Yersika</a> next trips.</p>\n<p>Sadly I have to cancel my trip to Cambodia in behalf of Taiwan, to try to have a better impact on the primary goal of this <a href=\"{{site.url}}/articles/2016/01/19/around-the-drupal-world-in-120-days\">journey</a> foster Drupal 8 and Drupal 8 in Asia and Oceania.</p>\n<p>Now, all my flight are set from South Korea, passing by Japan, China, Thailand, Hong Kong and ending in Taiwan. Also, I requested my visa to Australia.</p>\n<p>Back in tourist aspects, we visit <a href=\"https://en.wikipedia.org/wiki/H%E1%BB%8Fa_L%C3%B2_Prison\">Hỏa Lò Prison</a> or <strong>The Hanoi Hilton</strong> as is known in The USA. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/hanoi-hilton.jpg\"/></p>\n<p>This museum dedicated the most of their exhibitions to the usage of the prison during the French occupation against they comrades and how hard were their conditions; In the other hand, the show how the prison was used in the war against the USA and how good were their treatment for prisoners of war of the USA.</p>\n<p>After lunch, we ended up in <a href=\"https://en.wikipedia.org/wiki/Imperial_Citadel_of_Th%C4%83ng_Long\">Imperial Citadel of Thăng Long</a> which is a <strong>UNESCO’s World Heritage Site</strong>; This museum is an important archeological spot, also have some exhibitions about the different usages of the Citadel for more than ten centuries.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/vietnam-history-museum.jpg\"/></p>\n<p>We return early to the hotel to try to prepare the latest details of my presentation for <a href=\"http://drupalcamp.vn/en/\">DrupalCamp Vietnam</a>.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Hanoi (today)</td>\n<td>15044</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>225.763</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>240.807</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}