{"layout":"post","title":"Traveling to Vietnam - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Singapore","Hanoi","Vietnam"],"body":"<p>It’s time to say goodbye to Singapore, and prepare our next trip, In our morning we start to define the route for <a href=\"http://yersika.com\">Yersika</a> to Australia and after several options, we find a reasonable price flight traveling between SEL &#8594; MEL &#8594; BNE &#8594; HNL.</p>\n<p>Guess what we have a dim sum again, no new ones so no #foodporn  today :P.</p>\n<p>To go to the airport, we use the <a href=\"https://www.smrt.com.sg/\">SMRT</a>. I have to repeat I love the transport system of Singapore, at the airport station we return four tourist cards, and they return 40 SGD. So basically, we only expend <strong>80 SGD</strong> =  <strong>57.13 USD</strong> for two persons during six days and bargain from my point of view.</p>\n<p>To try to be prepared for Vietnam I choose to change my latest Singaporean Dollars, and I got 1.5 million ( 3 notes) Vietnamese dongs, wow was the first time in my life that amount of money in my wallet.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/a-lot-money.jpg\"/></p>\n<p>Now I can evaluate the airport better; they offer a movie theater for free and free wi-fi, so all you need for an extended stop in Singapore. At passport control, they ask you for a little piece of paper that they gave your when you enter in Singapore. The security control is not general; each gate has his own luggage check-in procedure. So, by far the best airport  I have ever seen in my life.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/singapore-airport.jpg\"/>\n<br/><br/>\n<img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/singapore-bye.jpg\"/></p>\n<p>We choose Vietnam Airlines to flight to Vietnam; the flight was comfortable, and the duration from Singapore is almost 3 hours, and they provide good food.</p>\n<p>The entry in Vietnam was quite easy; we don’t have to fill out an immigration form, they just check your passport and in luggage control they don’t require to pass through x-ray machines.</p>\n<p>The <a href=\"http://drupalcamp.vn\">DrupalCamp Vietnam</a> organizers, arrange a taxi driver to wait for us at the airport, Hanoi is quite better that I was expecting, being honest, I don’t see any communist spirit and nothing looks worst than capitalist countries in Latin America.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/enzo-yersika.jpg\"/></p>\n<p>We finish our day eating Viet food in the street, was cheap and delicious.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/hanoi-street-food.jpg\"/></p>\n<h2 id=\"airplane\">Airplane</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (Kilometers)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Singapore &#8594; Hanoi - Vietnam</td>\n<td>2.200</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>20.035</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>22.325</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Singapore/Vietnam (Today)</td>\n<td>7623</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>182.242</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>189. 865</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}