{"layout":"post","title":"Beijing Day 3 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Beijing","China"],"body":"<p>All my experience in Beijing have been during a long weekend that ends yesterday, but until now I have to say Beijing is extraordinarily crowded. At some moments I feel the overpopulation problem, not really in the subway, because there are a lot of wagons and very frequent, but outside is different, thousands and thousands for folks. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/bejing-crowded.jpg\"/></p>\n<p>Yesterday the blue sky was gone, but nothing worsts that Shanghai. But, due yesterday is holiday my option were limited. </p>\n<p>So I decided to check if  <a href=\"https://en.wikipedia.org/wiki/Tiananmen\">Tian’anmen</a> was open and it was, and I decided to visit the Tower. Something weird for me was that the security was quite more strict compared with the <strong>Forbidden City</strong>, looks like the Tian’anmen represent the current government, and the Forbidden City is just a tourist trap.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/tianamen-tower.jpg\"/></p>\n<p>After finish, I just took a walk outside the palace around the canal that surround the palace.</p>\n<p>To return to <a href=\"https://en.wikipedia.org/wiki/Tiananmen_Square\">Tian’anmen square</a>, I have to take a long and crowded queue again to past the security control. All important places around the plaza were closed due the holiday, but still were a lot of people like me taking photos of the places.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/tianamen_square.jpg\"/></p>\n<p>Behind the Mao mausoleum, I found the <a href=\"https://en.wikipedia.org/wiki/Zhengyangmen\">Zhengyangmen</a> an ancient gate of Beijing and was open, so I did just to finish my tour.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/zhengyangmen-1.jpg\"/>\n<br/><br/>\n<img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/zhengyangmen-2.jpg\"/></p>\n<p>I will return to the rest of places, but yesterday I found a shortcut with less people apparently we will see tomorrow.</p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Beijing (today)</td>\n<td>14824</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>652.265</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>667.089</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}