{"layout":"post","title":"India Day 1 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Mumbai","India"],"body":"<p>Today I want to share my experiences as a tourist in India without internet, so today was a kind of purge or abstinence day choose one.</p>\n<p>Because it’s is Sunday I suppose the typical tourist sport will have crowded for tourist and locals, so I decided to stay apart of that areas, and I choose to explore the north of Mumbai.</p>\n<p>##Kanheri Caves\nFirstly, I set my route to <a href=\"https://en.wikipedia.org/wiki/Kanheri_Caves\">Kanheri Caves</a> located at Sanjay Gandhi National Park, to reach that place I request a Uber to pick up me in my Airbnb works like a charm and leave at 8:30 a.m.</p>\n<p>National and tourists have to pay a fee of 44 rupees to get into the park, Caves are on a hill inside the park located about seven kilometers from the main gate, there a service of buses with a fare of 8 rupees each way and there is also a bike rental service.</p>\n<p>I skip the bike rental due do you have to provide an ID and pay a deposit. If you decide to rent a bike take into account that there aren’t stands to secure the bike meanwhile do you visit the caves, the bus service starts at 9:00 a.m. ish, for that reason I take the desition of doing exercise and walk.</p>\n<p>Mumbai wasn’t too hot, so the walk was pleasant in the middle of a dry forest, there were some “houses”, and you can find some ladies selling fruits, seed, and water every 2 kilometers approx.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/ladies-selling.jpg\"/></p>\n<p>In the second half of the road, there were a lot of monkeys, doing some aggressive sounds but nothing else, like everything in life the last mile was the harder position of the walk especially due the hill. Close the caves the well-behaved monkeys change their attitude and in the main entrance one animal almost take my bag with my belongs inside. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/monkey.jpg\"/></p>\n<p>About the caves, they a series of chambers sculpted in a solid rock mountain, Kanheri was a Budish monastery start before Jesus Christ era until 11 century.</p>\n<p>To see the majority of caves do you have to hike using sculpt steps, and some of them are a little risky, so I recommend hiking shoes. There are some caves bigger that others and with more or fewer Buddhas inside, some of them are dark and creepy. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/bhuda-caves.jpg\"/></p>\n<p>To return I choose the bus option, I was so tired, walking outside the park for some blocks I found a tiny restaurant where I ordered Chicken tandoori masala, the dish was so spicy even that I ordered no spicy.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/chicken-tandoori-malasa.jpg\"/></p>\n<p>##Global Vipassana Pagoda\nWith forces renewed after lunch, I took a Tuk Tuk toward to  <a href=\"https://en.wikipedia.org/wiki/Gorai\">Gorai</a> Beach, where I bought a round trip ferry ticket for 50 rupees. I have the say India have a lot strong of smells that maybe some people can’t support, especially in you have around a fish market like in Gorai.</p>\n<p>The ferry takes about 20 minutes to rest the destination, apart of Global Pagoda there are two entertainment parks, nobody will ask you for the ticket inside the ferry, but when you walk towards to pagoda there is a guy how to check your ticket and when you return the same.</p>\n<p>The global pagoda was finished at 2009, and it’s a Budish temple, even I am not a religion person I could appreciate how beautiful is and look like is important for a lot of  people.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/global-pagoda.jpg\"/></p>\n<p>You don’t have to pay to see the pagoda, but only in the border of the pagoda, due inside there are always some pupils doing meditation with their guru. Outside there are some free guides providing information about why and who the pagodas was built.</p>\n<p>There is another small pagoda named North Pagoda and you can use to take a meditation class if you have time.</p>\n<p>To return home, I took another Tuk Tuk, due I don’t have an internet connection.</p>\n<p>There two important things to mention, until now I found is weird found people who speak English, and nobody tried to take advantage of my condition of tourist, well play Indians folks.</p>\n<p>##Mingling with local and outsiders </p>\n<p>To end my day I have a nice dinner with J.A.M and Ani Gupta, to talk anything and everything, conversation Pre DrupalCon and Post DrupalCon are an important aspect of be part on a <a href=\"\">DrupalCon</a></p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/chilling.jpg\"/></p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mumbai (Today)</td>\n<td>21860</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>24.926</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>46.786</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}