{"layout":"post","title":"Traveling to South Korea - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Hanoi","Vietnam","Seoul","South Korea"],"body":"<p>Yesterday was that awkward moment when you have to leave your hotel, but your flight is not ready to go, so you have to be prepared for random situations.</p>\n<p>In our case, we choose to wake up late and just in time to take the hotel breakfast and return to our room to continue doingsome planning for our two next destinations.</p>\n<p>After checkout and leaving our luggage under hotel custody, we go out to do some typical tourist shopping. We bought some magnets, Vietnamese hats, bags and caps, and a football uniform of Vietnam for our son Axel.</p>\n<p>Because we still have a lot of time, I decided to take a hair cut.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/hanoi-haircut.jpg\"/></p>\n<p>For lunch, we decided to take a rest from noodles, and we went to KFC :P.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/hanoi-kfc.jpg\"/></p>\n<p>With about still 6 hours ahead to decided to sit down in the street to drink the cheapest beer I tried in my light Bia Ho. We only pay USD 0.22 per glass; It’s a light beer but don’t get confuse after five glasses you’ll feel I little dizzy, accompanied by a local version of Doner Kebab.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/haboi-cheap-beer.jpg\"/></p>\n<p>The airport process was as simple as our arrival, not too many controls, the flight was comfortable and almost empty, we departure at midnight and after three hours of flight, we arrive at ICN airport in Seoul.</p>\n<p>In the airport I asked at the information desk and the provide the information about what bus or train we could take. Finally, we bought an express rail ticket to reach seoul, but we get lost in the subway system, mainly because we bought train card, put money and doesn’t work, so the trip was longer than expected trying to resolve the issue.</p>\n<p>At the hotel due we arrive too early for checking, about at 11 am. Fortunately, they allow us to access the room.</p>\n<p>if you are interested in, see image and videos about this part of our trip, you can check out the at <a href=\"https://www.flickr.com/photos/37690888@N03/sets/72157665188490435\">Hanoi album</a> and <a href=\"https://www.flickr.com/photos/37690888@N03/sets/72157664777169280\">Ha Long Bay album</a>.</p>\n<h2 id=\"airplane\">Airplane</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (Kilometers)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Hanoi - Vietnam &#8594; Seoul - South Korea</td>\n<td>2.745</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>22.325</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>25.070</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Hanoi (today)</td>\n<td>7.650</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>261.241</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>268.891</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}