{"layout":"post","title":"Manila Day  2 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Manila","Philippines"],"body":"<p>Indeed, death is part of our life, if the only thing everybody if sure is about the dead will wait for us. What Enzo smoked today you could be thinking right now, but I want to talk about a strong relation between life and death I see today in Manila.</p>\n<p>After brunch, I went out to <a href=\"https://en.wikipedia.org/wiki/Manila_North_Cemetery\">Manila North Cemetery</a> this is the biggest cemetery in Phillippines and maybe one of the largest in the world. It’s too big that they have an address system base in street and avenues, taxis and cars have free access to the commentary, but to be honest doesn’t look like a cemetery, check the picture is just like a regular neighbourhood in a country in develop.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/manila-cementery-1.jpg\"/></p>\n<p>When I walk a little more in the graveyard I could identify people selling drinks, flower, and others, until here could be not weird for some people; But later I saw entire families with children in arms “living” in big mausoleums maybe never visited for their relatives. Why perhaps you ask, well living among dead people doesn’t look so bad if your other option is living under a bridge or just on a sidewalk.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/manila-cementery-2.jpg\"/></p>\n<p>They look like very adapted to live here, and must to be a lot of people; because they have some basketball fields, and I found evidence that they are running a championship.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/manila-cementery-3.jpg\"/></p>\n<p>At the end as I said the cemetery looks like a neighborhood, so they just reuse the soil in their benefit.</p>\n<p>Continuing with the sightseeing, I walk a lot due; I didn’t realize how hard is take a taxi in Manila downtown. I visit the <a href=\"https://en.wikipedia.org/wiki/Masjid_Al-Dahab\">Golden Mosque</a> to be honest nothing especial, but the Philippines is a Catholic country.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/manila-golden-musque.jpg\"/></p>\n<p>Nevertheless, around the mosque are thousands and thousands of street shop, where you can find anything inside this functional chaos.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/manila-street-shops.jpg\"/></p>\n<p>At night, I join with others foreigners that are in The Philippines for <a href=\"http://2016.drupalcampmanila.com\">DrupalCamp Manila 2016</a>. Easily this could be an APAC Drupal Summit because:</p>\n<ol>\n<li>We have an <a href=\"http://www.ibtimes.com/apec-blue-skies-fail-cheer-beijing-residents-government-rushes-clean-air-ahead-summit-1721371\">APAC Blue Sky</a>.</li>\n<li>We have people from 10 countries (Japan, Indonesia, India, Norway, USA, Singapore, Canada, Vietnam, Colombia, and  the Philippines)</li>\n</ol>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/pre-drupalcamp-manila.jpg\"/></p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Manila (today)</td>\n<td>20.914</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>1.086.601</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>1.107.515</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}