{"layout":"post","title":"DrupalCon Asia Day 3 - Tour 2016","categories":["Articles"],"tags":["DrupalCon","Travel","Enzotour16","Mumbai","India"],"body":"<p>I just realise that less picture to share means I had more interaction with people, which it’s good.</p>\n<p>This day starts with a keynote by <a href=\"http://danesecooper.blogs.com\">Danese Cooper</a> and his talk was about milestones in the Drupal project and Open source in India, giving recognition to leaders in India community, I guess was a good way to encourage local community.</p>\n<p>After the keynote, volunteers and local organizers, performance a flash mob using India songs.  I have to say it was magnificent; they use the stage and aisles, so at any time, you were surrounded by an Indian dancer, cool moment folks.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/flashmob.jpg\"/></p>\n<p>I was glad in attending the session <a href=\"https://events.drupal.org/asia2016/sessions/how-build-sustainable-contribution-culture-your-organization\">How to build a sustainable contribution culture in your organization</a> lead by <a href=\"https://www.drupal.org/u/a_thakur\">Ashish Thakur</a> and <a href=\"https://www.drupal.org/u/manjitsingh\">Manjit.Singh</a> they explain that everybody could share and support Open Source and how some ways to do that in your organization.</p>\n<p>I expend the rest of my day talking with people in the hall of the event, about nothing and everything. I found that Indians were so glad and proud of held this event, and they must be especially proud; the event was really well organized.</p>\n<p>Sadly, all good things come to an end, and I have to say good bye to new friends and miss the contribute sprint due I have to continue in my <a href=\"{{site.url }}/articles/2016/01/19/around-the-drupal-world-in-120-days/\">#enzotour16</a> Next stop <strong>Singapore</strong>.</p>\n<p>I have a recommendation for travelers, arrive at the airport with time because I expend 90 minutes from queuing to claim my boarding passing security controls. </p>\n<p>If you are interested in, see my pictures and videos feel free to check my flicker <a href=\"https://www.flickr.com/photos/37690888@N03/albums/72157664534751452\">India album</a></p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mumbai (Today)</td>\n<td>13.124</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>98.288</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>111.412</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}