{"layout":"post","title":"Traveling to Japan - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Seoul","South Korea","Tokyo","Japan"],"body":"<p>Yesterday was a day of changing a country in the trip; I  couldn’t sleep well, only about 2.5 hours.</p>\n<p>My flight to Japan departure from Incheon Internation Airport at 8:40 am. When I was packing, I notice the low-cost company I choose to flight to Japan have a 15 KG restriction and almost USD $90 for a second checked luggage.  So, I unwrap my backpacker bag and set everything to leave behind my laptop backpack and some pijamas, if were necessary, due I still have like 6 km over the weight limit. </p>\n<p>Fortunately, the airline doesn’t say anything about my luggage, and I can continue with all my stuff.</p>\n<p>The Narita airport is huge but well organized, after passing control I can get a sim card with Internet connection, and the information desk tries to explain to me that there are several train operators and different kind of trains. Finally, I choose the cheapest one. The Narita airport is quite remote from Tokio.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/tokio-metro.jpg\"/>]</p>\n<p>In my hotel I try to prepare my schedule for this week, this week will be agitated with two sessions in Tokio, a trip an overnight trip to Osaka and a meeting in Osaka.</p>\n<p>Looking the top places to visit in my short period in Tokyo, I found a website that helps me to organize my tour <a href=\"http://www.visitacity.com\">http://www.visitacity.com</a>. I have to say I am on a hook with this web application, how I can live without this before :P/</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/visitacity.png\"/>]</p>\n<h2 id=\"airplane\">Airplane</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (Kilometers)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Seoul, South Korea &#8594; Tokyo, Japan</td>\n<td>1.154</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>25.070</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>26.224</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Seoul (today)</td>\n<td>5.161</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>353.189</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>358.350</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}