{"layout":"post","title":"Singapore Day 1 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Singapore"],"body":"<p>Today I join to my wife <a href=\"http://yersika.com\">Yersika</a> at Singapore airport.</p>\n<p>After landing was easy to get a SIM card with 5 GB internet by 50 SGD, warning, do you have to change or create a new AP in your phone settings. </p>\n<p>We buy a three days card to use the <a href=\"https://en.wikipedia.org/wiki/Mass_Rapid_Transit_(Singapore\">Mass Rapid Transit</a>) by SGD 30 each one and using the website <a href=\"http://gothere.sg/maps\">http://gothere.sg/maps</a> we receive instructions about how to get home.</p>\n<p>After checking we decided to go to the famous, <a href=\"http://www.orchardroad.org\">Orchard road</a> and avenue full of parks and shopping centers, I found nice that there a lot of sceneries available to people to take pictures of themselves all along the road.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/orchard-road.jpg\"/></p>\n<p>Using foursquare we search for a Ramen restaurant and, to be honest, we get lost, because the restaurant was located underground. We discover that there a huge mall underground connected with subway stations and were more people doing shopping and eating than about on the surface, we didn’t find our restaurant, so we chose a Pho restaurant and was a good desition.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/singapore-pho.jpg\"/></p>\n<p>With our energies restored, we walk toward <a href=\"https://en.wikipedia.org/wiki/Fort_Canning\">Fort Canning Park</a> located on a hill, be prepare to walk a lot and climb hundreds step to reach the top of the hill, the part have the ruins of an ancient fort.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/singapore-fort.jpg\"/> </p>\n<p>Next to the part we found the <a href=\"http://nationalmuseum.sg\">National Museum of Singapore</a> where we learn a little bit about the history of Singapore, the entry it’s free, and there are some feature expositions, I thunk we will return at some point this week.</p>\n<p>Our tour today ends at the museum, due we felt so tired and is better to retrieve and regroup our forces for the rest of week.</p>\n<p>You will notice I publish fewer pictures than usual when I am with my wife, due she had a real camera and took better pictures than me. </p>\n<p>I have to say this state city is fantastic, everything works like a charm, I am looking forward seeing more awesomeness tomorrow.</p>\n<h2 id=\"airplane\">Airplane</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (Kilometers)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mumbai - India &#8594;  Singapore</td>\n<td>3908</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>16.127</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>20.035</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Singapore (Today)</td>\n<td>13.255</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>111.412</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>124.667</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}