{"layout":"post","title":"Getting node comments programmatically in Drupal 8","categories":["Articles"],"tags":["Drupal 8","Drupal","PHP"],"body":"<p>This article belongs to tips and tricks section in Drupal 8 because I will explain to you how to get entity comments from a particular entity node.</p>\n<p>Before to start to code, I want to clarify that in Drupal 8 comments could be inside <strong>Content type</strong> definition as a standard field.</p>\n<p>I will handle comments here as a separate entity. To get comments I will use <a href=\"https://api.drupal.org/api/drupal/core!lib!Drupal.php/function/Drupal%3A%3AentityQuery/8\">EntityQuery</a> using this approach, we will avoid writing explicit SQL queries, and our code will portable.</p>\n<pre><code>$cids = \\Drupal::entityQuery(&#39;comment&#39;)\n   -&gt;condition(&#39;entity_id&#39;, $ticketID)\n   -&gt;condition(&#39;entity_type&#39;, &#39;node&#39;)\n   -&gt;sort(&#39;cid&#39;, &#39;DESC&#39;)\n   -&gt;execute();\n\n$comments = [];\n\nforeach($cids as $cid) {\n $comment = Comment::load($cid);\n\n $comments[] = [\n     &#39;cid&#39; =&gt; $cid,\n     &#39;uid&#39; =&gt; $comment-&gt;getOwnerId(),\n     &#39;subject&#39; =&gt; $comment-&gt;get(&#39;subject&#39;)-&gt;value,\n     &#39;body&#39; =&gt; $comment-&gt;get(&#39;field_comment_body&#39;)-&gt;value,\n     &#39;created&#39; =&gt; $comment-&gt;get(&#39;created&#39;)-&gt;value\n ];\n}\n</code></pre><p>Let’s review the code above in detail; As you can see, is required to specify to what kind of entity we are trying to get comments, that tell us that in Drupal 8 is possible to link comments to any entity.</p>\n<p>Additionally, I have specified the Entity ID required to get comments, is possible add more conditions; this is useful taking in count that comments are entities and is possible that comments have customs fields with extra information.</p>\n<p>When we create the EntityQuery, we define what kind of entity we want to process, as the result the query execution will return a list primary keys of entities matching the conditions, in this case, the main key is represented by cid.</p>\n<p>Using the list of comments ids or cids, we load the comment object. I just traverse the option to create an arbitrary array, only to show how do you have to access to comment entity property, usually is required to use the method get, but there are some exceptions like comment owner ID.</p>\n<p>I hope do you found this article useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}