{"layout":"post","title":"Form altering will not be the same in Drupal 8 after using Webprofiler","categories":["Articles"],"tags":["Drupal 8","Drupal","PHP","Form","Webprofiler"],"body":"<p>One of the most common tasks as a Drupal developer is alter a form created by Drupal core of by a contrib module to \nenable us to include our business logic or  just remove something annoying for our clients.</p>\n<p>In Drupal 8 we still have to the hook <a href=\"https://api.drupal.org/api/drupal/core%21lib%21Drupal%21Core%21Form%21form.api.php/function/hook_form_alter/8\">hook_form_alter</a>, I know, I know the whole idea of Drupal 8 is to remove hooks, but we still have some of them around.</p>\n<p>But, this article is not about to discuss that hook must exist or not, Is there and we have to use until is replaced by something else.</p>\n<p>Doing a form alter require a one significant and vital information the <strong>FORM_ID</strong>. Usually, we can get this information implementing a generic form alter and print all form_ids loaded and choose the desired one, or, check in form source code to verify the id in method <strong>getFormId</strong> as you can see in the following method</p>\n<pre><code>  /**\n   * {@inheritdoc}\n   */\n  public function getFormId() {\n    return &#39;search_block_form&#39;;\n  }\n</code></pre><p>That doesn’t look like an old fashion way? indeed, it’s the old fashion way. Drupal 8 allow us to have excellent third party tools, and I want to talk about <a href=\"https://www.drupal.org/project/devel\">Webprofiler</a>, which in combination with the <a href=\"http://drupalcosole.com\">Drupal Console</a> project, provide us a clever way to determine and generate our form alter, fast and efficient.</p>\n<p><a href=\"https://www.drupal.org/u/lussoluca\">Lussoluca</a> created the webprofiler module, and is an effective implementation of <a href=\"http://symfony.com/doc/current/cookbook/profiler/index.html\">Symfony profiler</a>, using this component to write and extension to provide the Drupal things that Symfony profiler ignore. Webprofiler start as an independent project at <a href=\"https://www.drupal.org/project/webprofiler\">https://www.drupal.org/project/webprofiler</a>, but the last December was merged as a submodule of Devel module; honestly I don’t understand because there is not any technical dependency, IMHO webprofiler must have an independent project.</p>\n<p>#Generate a standard form alter.</p>\n<p>Anyhow, let me show you how to generate a form alter using the <strong>Drupal Console</strong> without <strong>Webprofiler</strong>. </p>\n<p>Using the command <strong>generate:form:alter</strong> we could generate an implementation of hook hoo_form_alter in any desired module, let show you who to execute this command avoiding interactive mode</p>\n<pre><code>$ drupal generate:form:alter  --module=&quot;testing&quot; --inputs=&quot;name:name type:textfield label:Name options: description: maxlength:64 size:64 default_value: weight:0&quot; --no-interaction\n</code></pre><p>As result, we will get the following code:</p>\n<pre><code>use Drupal\\Core\\Form\\FormStateInterface;\n\n/**\n * Implements hook_form_alter() on behalf of testing.module.\n */\nfunction testing_form_alter(&amp;$form, FormStateInterface $form_state, $form_id) {\n    // Change form id here\n    if ($form_id == &#39;form_test_alter_form&#39;) {\n        drupal_set_message(&#39;form_test_form_alter() executed.&#39;);\n\n        $form[&#39;name&#39;] = array(\n          &#39;#type&#39; =&gt; &#39;textfield&#39;,\n          &#39;#title&#39; =&gt; t(&#39;Name&#39;),\n          &#39;#description&#39; =&gt; t(&#39;&#39;),\n          &#39;#maxlength&#39; =&gt; 64,\n          &#39;#size&#39; =&gt; 64,\n          &#39;#weight&#39; =&gt; &#39;0&#39;,\n        );\n\n    }\n}\n</code></pre><p>Checking out, the code above we can see that is just an example, and you need to change the proper form id, but, at least, we have a starting point and example about how to add new form elements.</p>\n<p>#Generate a form alter using webprofiler.</p>\n<h2 id=\"installing-and-enabling-webprofiler-\">Installing and enabling Webprofiler.</h2>\n<p>Firstly, you need to get the latest version of devel module, because as I said before, webprofiler is a submodule of devel. Let’s do that using <strong>Drupal Console</strong>.</p>\n<pre><code>$ drupal module:download devel --latest\n</code></pre><p>Secondly, just enable the webprofiler module as you can see in the following snippet.</p>\n<pre><code>$ drupal module:install webprofiler\n</code></pre><h2 id=\"generating-a-form-alter-using-webprofiler\">Generating a form alter using Webprofiler</h2>\n<p>After enabling the module we just need to navigate to your website visiting the pages with forms we can to alter, when Webprofiler is installed you will get a toolbar at the bottom as you can see in the following image.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/drupal_webprofiler.png\"/></p>\n<p>Now, If we want to include an extra field in theme configuration, we just need to visit page <a href=\"http://example.comv/admin/appearance/settings/bartik\">http://example.comv/admin/appearance/settings/bartik</a> tp store form information in Webprofiler inventory.</p>\n<p>Using the command <strong>generate:form:alter</strong> but now in interactive mode, the command will detect that webprofiler module is installed, and we will provide us a list of form id available and give us the option to remove some fields from form, as you can check out in the following image.</p>\n<pre><code>drupal generate:form:alter --module=testing\n</code></pre><p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/console_generate_webprofiler.png\"/></p>\n<p>The interactive mode provides a list of form ids available; you can use the arrows on your keyboard to navigate through options available.</p>\n<p>The code generated now will be more precise and as you can see using the Webprofiler inventory we could decide to remove some form elements and still include new ones. The code generated will be similar to the following snippet.</p>\n<pre><code>use Drupal\\Core\\Form\\FormStateInterface;\n\n/**\n * Implements hook_form_FORM_ID_alter() on behalf of testing.module.\n * @see \\Drupal\\system\\Form\\ThemeSettingsForm method buildForm at core/modules/system/src/Form/ThemeSettingsForm.php\n */\nfunction testing_form_system_theme_settings_alter(&amp;$form, FormStateInterface $form_state) {\n    drupal_set_message(&#39;testing_form_system_theme_settings_alter() executed.&#39;);\n\n    $form[&#39;color&#39;][&#39;#access&#39;] = FALSE;\n\n}\n</code></pre><p>As you can see the sky is the limit we can create commands to do a lot of magic using Webprofiler inventory.</p>\n<p>I hope do you found this article useful.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}