{"layout":"post","title":"New York - Drupal Tour 2016","categories":["Articles"],"tags":["Drupal","Travel","Enzotour16","NYC","USA"],"body":"<p>I am very excited to report the beginning of my tour <a href=\"http://enzolutions.com/articles/2016/01/19/around-the-drupal-world-in-120-days\">Around the Drupal World in 120 Days</a>.</p>\n<p>As I read recently on a random post in Facebook. “A trip have three stages.” </p>\n<ol>\n<li>When you plan the trip</li>\n<li>When you live the trip </li>\n<li>When you remember the trip </li>\n</ol>\n<p>So I am living the second part of my trip and I want to share with you what I did in this short time (48 hours) in New York, maybe could help other travelers.</p>\n<p>##La Guardia Airport\nThis was my first time in this airport I could say a small and friendly airport, I don’t have any problem, and they have staff that can provide you some tourist information.</p>\n<p>I bought a <a href=\"http://web.mta.info/metrocard\">MetroCard</a>, which is valid for buses and subway; they have to machines to buy that card on opposite sides of the airport terminal B, the machine near to bus stop only operate with credit cards or coin. The metro card has a cost of $1 and you put what you want on top.</p>\n<p>There three buses lines operating from the airport and the ride from the airport is free is you have a MetroCard. </p>\n<p>I took the M60 bus to try to reach the Astoria Boulevard metro station, but be careful the driver announces the Astoria Boulevard at the beginning of the boulevard, and if you get off the bus, you will notice that you are not in Astoria Boulevard station. I made that mistake, but don’t worry if you do that, I took the next bus M19 using the MetroCard I bought before and finally reach the subway station to take the line G to reach Brooklyn my destination, that line connect with Manhattan and many other places.</p>\n<p>In Brooklyn, I meet up again with Vanessa and Edwin. They were so kind to share with me their spare room. BTW. Edwin was one of my first clients when I decided to start <a href=\"http://anexusit.com\">Anexus</a> with Kenny my business partner a workshop 100% oriented to Drupal, and he remains as a friend.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/edwin-vanessa-small.jpg\"/></p>\n<p>##Phase2 and Digital Pulp\nMy second day was good, even the -4 Celsius degrees, but I guess I was better to prepare than my last visit in NYC two years ago during NYCamp 2014 because at that time, in theory, was 7 Celsius degrees but for me was crazy freezing.</p>\n<p>I did a quick visit to <a href=\"http://phase2technology.com\">Phase2</a> one of the most well known Drupal Companies in USA and <strong>Anexus</strong> partner. I just pass over to say hello and of course, bring some Costa Rican coffee.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/molly.png\"/></p>\n<p>My lunch was at <a href=\"https://foursquare.com/v/lys-chinese-restaurant/540ce065498e413c5fa7929d\">Ly’s</a> Chinese Szechuan Restaurant, and I have a “Beef stew soup noodle” was so good. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/nyc-soup.png\"/></p>\n<p>After that I visited <a href=\"digitalpulp.com\">Digital Pulp</a> to present about <a href=\"http://drupalconsole.com\">Drupal Console</a> a Drupal project where I am co-maintainer, I was invited by <a href=\"https://github.com/FatherShawn\">Shawn Duncan</a> one of our contributors.</p>\n<p>The session was good, and I got some good feedback from backend and frontend developers.</p>\n<p><img style=\"float:left; margin-right: 20px; width: 47%; margin-bottom: 20px;\" src=\"{{site.url }}/assets/img/digitalpulp-1.jpg\"/></p>\n<p><img style=\"float:left; margin-right: 20px; width: 47%; margin-bottom: 20px;\" src=\"{{site.url }}/assets/img/digitalpulp-2.jpg\"/></p>\n<p>If you want to see the slides of that presentation go to <a href=\"http://bit.ly/enzotour16-nyc\">http://bit.ly/enzotour16-nyc</a>.</p>\n<p>##Last Day and my trip to India.\nI am going to Departure from Newark Airport in New Jersey; I already visit this airport twice on my way to Boston. Travel from NJ to Mumbai will be my longest trip in an airplane 11.5 hours non-stop, so I am full of movies and books. I will tell you in another post my experiences.</p>\n<p>I have to say the Newark airport is nice but not friendly with travelers, because there is not free wifi available.\nAt least I can use 30 min free connection from <a href=\"http://www.boingo.com\">Boingo</a>.</p>\n<h2 id=\"airplane\">Airplane</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (Kilometers)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Costa Rica &#8594; NYC</td>\n<td>3.575</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>0</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>NYC</td>\n<td>24.926</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>0</td>\n</tr>\n</tbody>\n</table>\n<p>Sounds a lot but I have more in front of me to explore.</p>\n","updatedAt":"2017-09-05T17:40:56.000Z"}