{"layout":"post","title":"DrupalCamp China - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Drupal","Shanghai","China","DrupalCamp"],"body":"<p>The main reason to be in Shanghai is to participate in DrupalCamp China. The DrupalCamp China was organized in conjunction with BarCamp; the organizers split the event into two rooms, one for Chinese speakers and one for English speakers.</p>\n<p>The keynote was presented by <a href=\"https://www.linkedin.com/in/jacobredding\">Jacob Reeding</a> and talk about the second wave of Open Source and the engagement with the community as companies and individuals.</p>\n<p>After the group photo, I have the opportunity to meet with some online friends from Shanghai. Also, I meet with some people that organizing events in Chengdu and Chongqing where I am going to participate, and we have a delicious lunch Chinese style.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/china-friends.jpg\"/>\n<br/><br/>\n<img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/drupalcamp-china-lunch.jpg\"/></p>\n<p>In the afternoon, I attend the session of <a href=\"https://www.adammalone.net/about\">Adam Malone</a> about how to do an effective demo; I love this session because he shows us how to sell Drupal by showing possibilities and not teaching about Drupal in low level.</p>\n<p>Right after, I have the opportunity to talk about <a href=\"http://drupalconsole.com\">Drupal Console</a> project, I was real that I can show the Drupal Console in action using the Chinese language, the room was totally occupied, and I got good questions at the end. </p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/drupalcampchina-console-session.jpg\"/></p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Shanghai (today)</td>\n<td>4.931</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>548.938</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>553.869</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}