{"layout":"post","title":"India Day 4 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Mumbai","India"],"body":"<p>Yesterday I decided to do a twist on my tour and try to visit a museum. But, before I have to pick up <a href=\"http://ranqiangjun.com/\">Qiangjun Ran</a>, Qiangjun is the maintainer of <a href=\"https://drupalconsole.com/docs/chinese\">Drupal Console</a> Chinese translation.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/meet-jungle.jpg\"/></p>\n<p>Qiangjun is also organizing a Drupal Meetup in his city Chongqing as part of my <a href=\"http://enzolutions.com/articles/2016/01/19/around-the-drupal-world-in-120-days/\">Drupal Tour</a>. I have to say hi gave me one the greatest presents you can receive as a <strong>knowmad</strong> traveler a sim card to get connected to China as soon I arrive in China, thanks again buddy.</p>\n<p>After taking a breakfast, we took an Uber towards “‘Dr. Bhau Daji Lad Museum”m due is a long ride, about 80 minutes, he explain to me some Chinese words and structures. when we reach our destination we foud the museum closed due is close all Wednesdays, lucky us. So, we continue a taxi towards <em>Gateway of India</em>.</p>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Gateway_of_India\">Gateway of India</a> is an iconic place and mandatory for tourists, It’s nice and especially when you read a little bit about his history.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/mumbai-art.jpg\"/>\n<br/><br/>\n<img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/gateway-india.jpg\"/></p>\n<p>After taking some pictures, we continue walking in the direction to Marina Drive, the area is pleasent full of shops, where I can found and buy some magnets for my fridge to increase our collection.</p>\n<p>Close to Marine drive, we found an Indian restaurant where we took a lunch, our random selection was Muttom Kheema and Golata + Jeera Rice.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/marina-drive-lunch.jpg\"/></p>\n<p>With our batteries charged we did a long walk through Marina Drive, it’s a beautiful place with an excellent view of Mumbai Skyline. Sunsets and Sunrises must be great to appreciate here.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/marina-drive.jpg\"/></p>\n<p>After having some issues with our internet we decided to take a taxi, but due was hot in Mumbai with about 30 Celsius degrees we want to take a cab with A/C to have a relax return to home, due is a trip of 90 minutes. </p>\n<p>Sadly, there aren’t not too many cabs with A/C, and we finally found a “cab” associated with “Ola Cabs” the Indian version of Uber. We have to bargain the price due at the begging he was to charge us 2.5 times the regular price and the end we agree on about 1.2 times the standard price.</p>\n<p>Back to the hotel, I helped to Qiangjun to get connected with the Slack group for Asian community of Drupal and telegram, some tools I think he can use to continue with contact with their APAC community. By coincidence, <a href=\"https://www.linkedin.com/in/ironkiat\">Kiat Lim</a> from Singapore and who helped me to organize a Drupal meetup in Singapore to talk about <strong>Drupal Console</strong> was in the same hotel, and we hang out with other Singapore Drupalers in an Indian restaurant.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/dinner-singore-folks.jpg\"/></p>\n<p>By 10 pm I was exhausted and ready to do some work, my jet lag is getting better I could sleep 6 hours. Today the DrupalCon start and I will participate in <a href=\"https://events.drupal.org/asia2016/government-summit\">Government Summit</a>.</p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mumbai (Today)</td>\n<td>13.140</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>65.379</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>78.519</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}