{"layout":"post","title":"India Day 2 - Drupal Tour 2016","categories":["Articles"],"tags":["Travel","Enzotour16","Mumbai","India"],"body":"<p>After passing my first day in India, I felt comfortable about how to handle this country as a tourist, so the sky is the limit, I said to myself. I was so wrong “The tuk-tuks are the limit”.</p>\n<p>I start my day decided to visit the south of Mumbai; I expected more traffic that the day before because was Sunday. But as soon I tried to request my Uber I notice there aren’t car available in UberX or UberBlack models, so weird right, the situation gets worse when some cars appear available, but the rate was increased until 8.X.</p>\n<p>Trying to understand the situation, I did the supposition maybe people start their days in the office around 9 or 10 am, so I skip the Uber to avoid the rush hour, and I decide to walk towards airtel office to try to get connected to The Internet from my cellphone. </p>\n<p>I bring in theory the requirement to get a sim card from <a href=\"http://www.airtel.in/\">Airtel</a>: passport, a passport copy, a photo and copy of visa. But, the manager of the shop said I need a valid visa for at least 90 days to get sim cards, WTF right. For that reason, I had to call to India 911 in my case I contact <a href=\"https://axelerant.com/team-member/parth-gohil/\">Parth Gohil</a>, and he rescue me request a sim card for him, lucky me he had two photographs in his wallet, BTW, who has two pictures in his wallet nowadays just in case :P.</p>\n<p>Having a sim card, but not connected yet because the activation process takes 24 hours, Parth explain to me that maybe the user rise in prices was related with the Tuk-tuks, or Rickshaws, as they are named in India, were in Strike, as soon he mention I realize the street looks different. So, I decided to Stay couple hours in Parth hotel’s room until the Rickshaws apocalypse past.</p>\n<p>At lunch time, <a href=\"https://www.drupal.org/u/highermath\">Cary Gordon</a> a former Drupal Association board member and <a href=\"https://in.linkedin.com/in/ashwinikumar7\">Ashwini Kumar</a> a developer from Srijian join us and we went to a Punjabi restaurant, food, and talk was so good that we forget to take a picture of us in the restaurant. Shame on us. </p>\n<p>After lunch Rickshaws, ther appocalypse still happen, but Uber prices reach a moderate 1.6 price factor. So Cory and I went to visit Bandra Fort and Carter Road at Bandra West.</p>\n<p><img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/mumbai-bridge.jpg\"/>\n<img style=\"margin-right: 20px;\" src=\"{{site.url }}/assets/img/enzo-bridge.jpg\"/></p>\n<p>I have to say that my conversation with Cory was exquisite because the told me about his experience as a board member of Drupal Association member.</p>\n<p>To end the day, I had a dinner with <a href=\"http://dasjo.at/\">Josef Dabernig</a>.</p>\n<p>it’s good to have time to talk with members of the Drupal community. In my concern the DrupalCon Asia started today.</p>\n<h2 id=\"walking\">Walking</h2>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Distance (steps)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mumbai (Today)</td>\n<td>13.378</td>\n</tr>\n<tr>\n<td>Previously</td>\n<td>46.786</td>\n</tr>\n<tr>\n<td><strong>Total</strong></td>\n<td>60.134</td>\n</tr>\n</tbody>\n</table>\n","updatedAt":"2017-09-05T17:40:56.000Z"}